logs/fio-diskseq/hpk/002/log007.txt
+ kubectl create namespace bench
namespace/bench created
+ kubectl create -n bench -f -
persistentvolumeclaim/claim1 created
+ kubectl create -n bench -f -
job.batch/fio created
+ kubectl wait --for=condition=complete --timeout=10h job/fio -n bench
job.batch/fio condition met
+ kubectl logs job/fio -n bench
Defaulted container "fio" out of: fio, init-container-resources (init)
INFO:    Converting SIF file to temporary sandbox...
kube-fio-write: (g=0): rw=write, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
kube-fio-write: Laying out IO file (1 file / 8192MiB)
3;fio-3.35;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;8388608;77900;304;107684;0;0;0.000000;0.000000;81;207592;3280.482867;8110.032167;1.000000%=96;5.000000%=98;10.000000%=100;20.000000%=104;30.000000%=105;40.000000%=108;50.000000%=114;60.000000%=142;70.000000%=185;80.000000%=7241;90.000000%=11599;95.000000%=16449;99.000000%=33816;99.500000%=40108;99.900000%=79167;99.950000%=104333;99.990000%=191889;0%=0;0%=0;0%=0;86;207596;3285.387785;8109.989080;3584;863744;100.000000%;77938.306977;100718.091929;0.182016%;4.063780%;7245;0;225;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;8.32%;69.73%;0.21%;0.00%;0.00%;0.00%;0.00%;9.66%;8.50%;3.34%;0.18%;0.05%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-2;364;1796;0;0;25116;129783;154899;61.14%;slaves;5371;33865;695;3411;382354;361512;771686;96.79%;sda;5371;33865;695;3411;382354;361512;771686;96.79%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=365: Sun Nov 26 18:29:07 2023
  write: IOPS=304, BW=76.1MiB/s (79.8MB/s)(8192MiB/107684msec); 0 zone resets
    clat (usec): min=81, max=207592, avg=3280.48, stdev=8110.03
     lat (usec): min=86, max=207596, avg=3285.39, stdev=8109.99
    clat percentiles (usec):
     |  1.00th=[    97],  5.00th=[    99], 10.00th=[   101], 20.00th=[   105],
     | 30.00th=[   106], 40.00th=[   109], 50.00th=[   115], 60.00th=[   143],
     | 70.00th=[   186], 80.00th=[  7242], 90.00th=[ 11600], 95.00th=[ 16450],
     | 99.00th=[ 33817], 99.50th=[ 40109], 99.90th=[ 79168], 99.95th=[104334],
     | 99.99th=[191890]
   bw (  KiB/s): min= 3584, max=863744, per=100.00%, avg=77938.31, stdev=100718.09, samples=215
   iops        : min=   14, max= 3374, avg=304.45, stdev=393.43, samples=215
  lat (usec)   : 100=8.32%, 250=69.73%, 500=0.21%
  lat (msec)   : 10=9.66%, 20=8.50%, 50=3.34%, 100=0.18%, 250=0.05%
  cpu          : usr=0.18%, sys=4.06%, ctx=7245, majf=0, minf=225
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,32768,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=76.1MiB/s (79.8MB/s), 76.1MiB/s-76.1MiB/s (79.8MB/s-79.8MB/s), io=8192MiB (8590MB), run=107684-107684msec

Disk stats (read/write):
    dm-2: ios=364/1796, merge=0/0, ticks=25116/129783, in_queue=154899, util=61.14%, aggrios=5371/33865, aggrmerge=695/3411, aggrticks=382354/361512, aggrin_queue=771686, aggrutil=96.79%
  sda: ios=5371/33865, merge=695/3411, ticks=382354/361512, in_queue=771686, util=96.79%
kube-fio-read: (g=0): rw=read, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
3;fio-3.35;kube-fio-read;0;0;8388608;343317;1341;24434;0;0;0.000000;0.000000;24;259485;665.886795;3303.027496;1.000000%=27;5.000000%=29;10.000000%=32;20.000000%=36;30.000000%=38;40.000000%=40;50.000000%=42;60.000000%=43;70.000000%=45;80.000000%=57;90.000000%=74;95.000000%=3653;99.000000%=15138;99.500000%=15532;99.900000%=25034;99.950000%=29491;99.990000%=35913;0%=0;0%=0;0%=0;24;259485;665.944638;3303.027243;82432;543232;100.000000%;379392.000000;164508.996073;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.151435%;13.162526%;9205;0;220;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;76.36%;14.03%;0.20%;0.31%;0.21%;0.14%;2.49%;1.83%;1.96%;2.28%;0.18%;0.00%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;dm-2;6870;2069;0;0;89953;9898;99851;90.82%;slaves;46011;3953;154;12;893737;16319;911681;98.71%;sda;46011;3953;154;12;893737;16319;911681;98.71%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=407: Sun Nov 26 18:29:32 2023
  read: IOPS=1341, BW=335MiB/s (352MB/s)(8192MiB/24434msec)
    clat (usec): min=24, max=259485, avg=665.89, stdev=3303.03
     lat (usec): min=24, max=259485, avg=665.94, stdev=3303.03
    clat percentiles (usec):
     |  1.00th=[   28],  5.00th=[   30], 10.00th=[   33], 20.00th=[   37],
     | 30.00th=[   39], 40.00th=[   41], 50.00th=[   43], 60.00th=[   44],
     | 70.00th=[   46], 80.00th=[   58], 90.00th=[   75], 95.00th=[ 3654],
     | 99.00th=[15139], 99.50th=[15533], 99.90th=[25035], 99.95th=[29492],
     | 99.99th=[35914]
   bw (  KiB/s): min=82432, max=543232, per=100.00%, avg=379392.00, stdev=164509.00, samples=43
   iops        : min=  322, max= 2122, avg=1482.00, stdev=642.61, samples=43
  lat (usec)   : 50=76.36%, 100=14.03%, 250=0.20%, 500=0.31%, 750=0.21%
  lat (usec)   : 1000=0.14%
  lat (msec)   : 2=2.49%, 4=1.83%, 10=1.96%, 20=2.28%, 50=0.18%
  lat (msec)   : 500=0.01%
  cpu          : usr=0.15%, sys=13.16%, ctx=9205, majf=0, minf=220
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=32768,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=335MiB/s (352MB/s), 335MiB/s-335MiB/s (352MB/s-352MB/s), io=8192MiB (8590MB), run=24434-24434msec

Disk stats (read/write):
    dm-2: ios=6870/2069, merge=0/0, ticks=89953/9898, in_queue=99851, util=90.82%, aggrios=46011/3953, aggrmerge=154/12, aggrticks=893737/16319, aggrin_queue=911681, aggrutil=98.71%
  sda: ios=46011/3953, merge=154/12, ticks=893737/16319, in_queue=911681, util=98.71%
INFO:    Cleaning up image...
+ kubectl delete namespace bench
namespace "bench" deleted